"""
3.	Осуществить программу работы с органическими клетками, состоящими из ячеек. Необходимо создать класс «Клетка».
В его конструкторе инициализировать параметр, соответствующий количеству ячеек клетки (целое число). В классе должны
быть реализованы методы перегрузки арифметических операторов: сложение (__add__()), вычитание (__sub__()), умножение
(__mul__()), деление (__floordiv____truediv__()). Эти методы должны применяться только к клеткам и выполнять
увеличение, уменьшение, умножение и округление до целого числа деления клеток соответственно.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять, только если разность количества ячеек двух клеток
больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создаётся общая клетка из двух. Число ячеек общей клетки — произведение количества ячеек этих двух клеток.
Деление. Создаётся общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества
ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
Этот метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, а количество ячеек в ряду — 5. В этом случае метод make_order()
вернёт строку: *****\n*****\n**.
Или количество ячеек клетки — 15, а количество ячеек в ряду равняется 5. Тогда метод make_order() вернёт строку:
*****\n*****\n*****.
"""


class Cell:
    def __init__(self, trays: int):
        self.trays = trays

    def __add__(self, other):
        return Cell(self.trays + other.trays)

    def __sub__(self, other):
        result = self.trays - other.trays
        if result > 0:
            return Cell(result)
        else:
            raise ValueError('Недостотачно ячеек в клетке для выполнения вычитания')

    def __mul__(self, other):
        return Cell(self.trays * other.trays)

    def __floordiv__(self, other):
        result = self.trays // other.trays
        if result == 0:
            result = other.trays // self.trays
        return Cell(result)

    def __truediv__(self, other):
        result = self.trays // other.trays
        if result == 0:
            result = other.trays // self.trays
        return Cell(result)

    def make_order(self, trays_in_row):
        return f'{"*" * trays_in_row}\n' * (self.trays // trays_in_row) + f'{"*" * (self.trays % trays_in_row)}'


cell1 = Cell(15)
cell2 = Cell(12)
print(cell1.make_order(5))
print('---------------------------')
print(cell1.make_order(6))
print('---------------------------')
print(cell2.make_order(5))

cell3 = cell1 + cell2
print('сложение', cell3.trays)
cell3 = cell2 / cell1
print('деление', cell3.trays)
cell3 = cell1 - cell2
print('вычитание', cell3.trays)
cell3 = cell1 * cell2
print('умножение', cell3.trays)