"""
2. Создать список, состоящий из кубов нечётных чисел от 0 до 1000:
Вычислить сумму тех чисел из этого списка, сумма цифр которых делится нацело на 7. Например, число «19 ^ 3 = 6859»
будем включать в сумму, так как 6 + 8 + 5 + 9 = 28 – делится нацело на 7. Внимание: использовать только арифметические
операции! К каждому элементу списка добавить 17 и заново вычислить сумму тех чисел из этого списка, сумма цифр которых
делится нацело на 7. Внимание: новый список не создавать!!!
"""


def sum_super_seven_and_teen(numbers, seventeen=0):
    result = 0  # создаем ссылку на результат
    for number in numbers:  # пробегаемся по каждому числу списка
        number += seventeen  # при необходимости прибавляем число
        sum = 0
        for digit in str(number):  # пробегаемся по кажому символы строки и суммируем цифры числа
            sum += int(digit)
        if sum % 7 == 0:  # проверяем деление на 7 и добавляем в результат
            result += number
    return result


if __name__ == '__main__':
    numbers = [number ** 3 for number in range(1, 1000, 2)]
    print("Cумма чисел из списка кубов нечетных чисел от 1 до 1000, сумма цифр которых делится нацело на 7:")
    print(sum_super_seven_and_teen(numbers))
    print("Cумма чисел из списка кубов нечетных чисел от 1 до 1000 плюс 17, сумма цифр которых делится нацело на 7:")
    print(sum_super_seven_and_teen(numbers, 17))
