"""
3. Реализовать склонение слова «процент» для чисел до 20. Например, задаем число 5 — получаем «5 процентов», задаем
число 2 — получаем «2 процента». Вывести все склонения для проверки.
"""

dictionary = {
    0: "0 процентов",  # словарь для уникальных значений
    1: "1 процент"
}

for i in range(2, 5):
    dictionary[i] = str(i) + ' процента'  # словарь для значений от 2 до 4
for i in range(6, 21):
    dictionary[i] = str(i) + ' процентов'  # словарь для значений от 5 до 20

for k, v in dictionary.items():
    print(dictionary[k])
