# 5.	Представлен список чисел. Определить элементы списка, не имеющие повторений. Сформировать из этих элементов
# список с сохранением порядка их следования в исходном списке, например:
# src = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
# result = [23, 1, 3, 10, 4, 11]
#
# Подсказка: напишите сначала решение «в лоб». Потом подумайте об оптимизации.


src = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]

print('Решение в лоб')
result = [number for number in src if src.count(number) == 1]
print(result)
print('____________________________________')

print('Оптимальное решение')
unique_src = set()
tmp = set()
for el in src:  # проходим по элементам числа
    if el not in tmp:  # если элемента нет во временном множестве включаем в результат
        unique_src.add(el)
    else:
        unique_src.discard(el)  # а если есть, например в случае повтора значения, наоборот исключаем из множества
    tmp.add(el)

result = [number for number in src if number in unique_src]  # для вывода в том же порядке что и в исходном списке
print(result)
