"""
2.	Реализовать класс Road (дорога).
●	определить атрибуты: length (длина), width (ширина);
●	значения атрибутов должны передаваться при создании экземпляра класса;
●	атрибуты сделать защищёнными;
●	определить метод расчёта массы асфальта, необходимого для покрытия всей дороги;
●	использовать формулу: длина*ширина*масса асфальта для покрытия одного кв. метра дороги асфальтом, толщиной в
●	1 см*число см толщины полотна;
●	проверить работу метода.

Например: 20 м*5000 м*25 кг*5 см = 12500 т.
"""


class Road:
    def __init__(self, length, width):
        self._length = length
        self._width = width

    def asphalt_mass_required(self, mass_for_cm, thickness):
        """

        :param mass_for_cm: масса асфальта в кг требуемого для покрытия 1 кв метра толщиной в 1 см
        :param thickness: толщина дороги в см
        :return: масса необходимого асфальта для покрытия дороги в кг
        """
        return self._length * self._width * mass_for_cm * thickness


street_1 = Road(20, 5000)
print(street_1.asphalt_mass_required(25, 5))
