-- (по желанию) Подсчитайте произведение чисел в столбце таблицы.

drop table if exists for_task_3;
create table for_task_3 (value int);

truncate table for_task_3; 
insert into for_task_3(value) values (1),(2),(3),(4),(5);

-- среди доступных функций mysql я не нашел произведения чисел столбца, однако имеется возможность вычисления натуральных логарифмов (ln) и суммы столбца (sum), также 
-- обратного возведения экспоненты (exp). Это аозволяет нам воспользоваться свойством логарифмов - логарифм произведения равен сумме логарифмов. 
-- Найдя логарифм произведения используем его как степень для экспоненты и определяем искомое значение.
select exp(sum(ln(value))) from for_task_3 ft;