-- В таблице складских запасов storehouses_products в поле value могут встречаться самые разные 
-- цифры: 0, если товар закончился и выше нуля, если на складе имеются запасы. Необходимо отсортировать 
-- записи таким образом, чтобы они выводились в порядке увеличения значения value. Однако нулевые запасы 
-- должны выводиться в конце, после всех записей.

-- для начала заполним таблицу данными

truncate table storehouses_products;
insert into storehouses_products (value)
values (0), (2500), (0), (30), (500), (1);

-- выибраем данные из таблицы с сортировкой по обратному значению value с убыванием

select*from storehouses_products sp 
order by 1/value desc;