# 3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y=kx+b, проходящей через эти точки.
x1 = int(input('Введите координату по оси X точки 1: '))
y1 = int(input('Введите координату по оси Y точки 1: '))
x2 = int(input('Введите координату по оси X точки 2: '))
y2 = int(input('Введите координату по оси Y точки 2: '))

k = (y1 - y2) / (x1 - x2)
b = y1 - k * x1
if b > 0:
    b_part_string = f' + {b}'
elif b < 0:
    b_part_string = f' - {abs(b)}'
else:
    b_part_string = f''

print(f'Уравнение прямой проходящих через данные точки иммеет вид :\n'
      f'y = {k}x' + b_part_string)
